In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r'C:\Users\keerthi\Downloads\Students_Performance.csv')

### Display Whole Table

In [3]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

### Males and Females participated in the test.

In [5]:
print (df.gender.value_counts())

gender
female    518
male      482
Name: count, dtype: int64

### Students' parental level of education

In [7]:
parents = df["parental level of education"].value_counts()
parents

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: count, dtype: int64

##### Ans :- According to the date Students parent level of education is high on some college and low on masters degree

### Scores the most on average for math, reading and writing based on
i.Gender
ii.Test preparation course

##### Mean score according to Gender

In [36]:
df[['gender','math score','writing score','reading score']].groupby(['gender']).agg('mean')

        math score  writing score  reading score
gender
female   63.376448      72.467181      72.590734
male     68.821577      63.446058      65.545643

##### Ans:- According to the mean scores the most on average for math is Male, reading  and writing is femail based on Gender

#### Mean score according to Test preparation course

In [34]:
df[['test preparation course','math score','writing score','reading score']].groupby(['test preparation course']).agg('mean')

                         math score  writing score  reading score
test preparation course
completed                  69.96648      74.684358      74.175978
none                       63.78972      64.457944      66.417445

##### Ans:- According to the table for math, reading  and writing female scored more than male

### Scoreing variation for math, reading and writing based on
i.Gender
ii.Test preparation course

In [37]:
df[['gender','math score','writing score','reading score']].groupby(['gender']).agg('median')

        math score  writing score  reading score
gender
female        65.0           74.0           73.0
male          69.0           64.0           66.0

#### Ans:- According to the finding, Female students score more than male students in writing and reading and Male students score more than Female students in Math

In [38]:
df[['test preparation course','math score','writing score','reading score']].groupby(['test preparation course']).agg('mean')

                         math score  writing score  reading score
test preparation course
completed                  69.96648      74.684358      74.175978
none                       63.78972      64.457944      66.417445

#### Ans:- According to the finding, students who done the test preperation course score more that other students

### Top 25% of students based on their math score

In [49]:
q75=df['math score'].quantile(q=.75)
df[df['math score'].ge(q75)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
414,female,group A,high school,free/reduced,completed,77,88,85
415,female,group B,master's degree,free/reduced,completed,77,97,94
416,female,group B,bachelor's degree,free/reduced,none,77,85,87
417,female,group B,master's degree,standard,none,77,90,84
418,female,group B,high school,standard,completed,77,82,89
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

### whether there is any increase in sales after stepping into digital marketing.

In [6]:
import pandas as pd1
import numpy as np1
import scipy.stats as stats

In [7]:
df1 = pd1.read_csv(r'C:\Users\keerthi\Downloads\Sales_add.csv')

In [13]:
f_stat,p_value=stats.ttest_rel(df1['Sales_before_digital_add(in $)'],df1['Sales_After_digital_add(in $)'])

In [17]:
f_stat,p_value

(-12.09070525287017, 6.336667004575778e-11)

In [16]:
if p_value<0.05:
    print('Reject Null Hypothesis')
else:
    print('Accept Null Hypothesis')

Reject Null Hypothesis

#### Ans:- As the Null hypothesis is rejected we can infer that there is an increase in sales after stepping into digital marketing.